[
  {"title": "Project Power",
    "genre": "Action",
    "description": "Project Power is a 2020 American superhero film directed by Henry Joost and Ariel Schulman, produced by Eric Newman and Bryan Unkeless, and written by Mattson Tomlin. It stars Jamie Foxx, Joseph Gordon-Levitt, and Dominique Fishback, alongside Colson Baker, Rodrigo Santoro, Amy Landecker and Allen Maldonado, and follows a drug dealer, a police officer, and a former soldier who team up to stop the distribution of a pill that gives the user superpowers for five minutes."
  },
  {
    "title" : "The Old Guard",
    "genre" : "Action",
    "description" : "The Old Guard is a 2020 American superhero film directed by Gina Prince-Bythewood and written by Greg Rucka, based on his comic book of the same name. The film stars Charlize Theron, KiKi Layne, Matthias Schoenaerts, Marwan Kenzari, Luca Marinelli, Harry Melling, Van Veronica Ngo and Chiwetel Ejiofor, and follows a team of immortal mercenaries on a revenge mission."
  },
  {
    "title" : "Mile 22",
    "genre" : "Action",
    "description" : "Mile 22 is a 2018 American action thriller film directed by Peter Berg and written by Lea Carpenter, from a story by Carpenter and Graham Roland.[5] The film stars Mark Wahlberg, Iko Uwais, John Malkovich, Lauren Cohan, and Ronda Rousey. It follows an elite CIA task force composed of paramilitary officers from the Special Activities Center's Ground Branch, that has to escort a high-priority asset 22 miles to an extraction point while being hunted by the government. The film marks the fourth collaboration between Berg and Wahlberg, following Lone Survivor, Deepwater Horizon, and Patriots Day."
  },
  {
    "title" : "The Platform",
    "genre" : "Thriller",
    "description" : "The Platform (Spanish: El hoyo, transl.The Hole) is a 2019 Spanish social science fiction-horror film directed by Galder Gaztelu-Urrutia. The film is set in a large, tower-style \"Vertical Self-Management Center\". Its residents, who are switched every 30 days between its many floors, are fed via a platform which, initially filled with food at the top floor, gradually descends through the tower's levels, stopping for a fixed amount of time on each. The system inevitably leads to conflict, as the residents at the top levels get to eat as much as they can, with each level getting only the leftovers from the previous ones."
  },
  {
    "title" : "#Alive",
    "genre" : "Action",
    "description" : "#Alive (Korean: #살아있다; RR: #Saraitda) is a 2020 South Korean zombie film directed by Cho Il-hyung. Starring Yoo Ah-in and Park Shin-hye, it is based on the 2019 script Alone by Matt Naylor, who co-adapted his script with Cho. The film revolves around a video game live streamer's struggle for survival as he is forced to stay alone at his apartment in Seoul during a zombie apocalypse. It was released in South Korea on June 24, 2020, and globally via Netflix on September 8, 2020."
  },
  {
    "title" : "The Sleepover",
    "genre" : "Comedy",
    "description" : "The Sleepover is a 2020 American action comedy film directed by Trish Sie, from a screenplay by Sarah Rothschild. It stars Sadie Stanley, Maxwell Simkins, Cree Cicchino, Lucas Jaye, Ken Marino, Joe Manganiello and Malin Åkerman. The film was released on August 21, 2020 by Netflix."
  },
  {
    "title" : "Instant Family",
    "genre" : "Comedy",
    "description" : "Instant Family is a 2018 American family comedy-drama starring Mark Wahlberg and Rose Byrne as parents who adopt three young children, played by Isabela Moner, Gustavo Escobar (Gustavo Quiroz), and Julianna Gamiz. Also starring Margo Martindale, Julie Hagerty, Tig Notaro, Iliza Shlesinger Octavia Spencer, the film is directed by Sean Anders, who wrote the screenplay with John Morris, based in part on Anders' own experiences."
  },
  {
    "title" : "The Occupant",
    "genre" : "Thriller",
    "description" : "The Occupant (Spanish: Hogar) is a Spanish 2020 thriller directed by David Pastor and Àlex Pastor, and written by David Pastor and Àlex Pastor. The plot revolves around Javier Muñoz (Javier Gutiérrez), a former executive who is forced to sell his apartment because of unemployment. He becomes obsessed with the new occupants, and begins infiltrating their lives."
  },
  {
    "title" : "Fractured",
    "genre" : "Thriller",
    "description" : "Fractured is a 2019 American psychological thriller film directed by Brad Anderson from a screenplay by Alan B. McElroy. It stars Sam Worthington, Lily Rabe, Stephen Tobolowsky, Adjoa Andoh, and Lucy Capri."
  },
  {
    "title" : "Escape Room",
    "genre" : "Thriller",
    "description" : "Escape Room is a 2019 American psychological horror film directed by Adam Robitel and written by Bragi F. Schut and Maria Melnik. The film stars Taylor Russell, Logan Miller, Deborah Ann Woll, Tyler Labine, Jay Ellis, Nik Dodani, and Yorick van Wageningen, and follows a group of people who are sent to navigate a series of deadly escape rooms."
  },
  {
    "title" : "The Wrong Missy",
    "genre" : "Comedy",
    "description" : "The Wrong Missy is a 2020 American romantic comedy film directed by Tyler Spindel, with a screenplay by Chris Pappas and Kevin Barnett. It stars David Spade and Lauren Lapkus, and was released on Netflix on May 13, 2020."
  },
  {
    "title" : "The Christmas Chronicles",
    "genre" : "Comedy",
    "description" : "The Christmas Chronicles is a 2018 American Christmas comedy film directed by Clay Kaytis from a screenplay by Matt Lieberman. The film stars Kurt Russell as Santa Claus, as well as Judah Lewis and Darby Camp, with Lamorne Morris, Kimberly Williams-Paisley, Oliver Hudson, Martin Roach, and Vella Lovell in supporting roles. It is the first installment in the The Christmas Chronicles film series. The film was produced by 1492 Pictures and Wonder Worldwide, and was released on November 22, 2018 on Netflix."
  },
  {
    "title" : "Work It",
    "genre" : "Action",
    "description" : "Work It is a 2020 American jukebox dance comedy film directed by Laura Terruso and produced by Alicia Keys, Leslie Morgenstein and Elysa Koplovitz Dutton. The film stars Sabrina Carpenter, Liza Koshy, Keiynan Lonsdale, Michelle Buteau and Jordan Fisher. It was released on August 7, 2020, by Netflix."
  },
  {
    "title" : "Saw: Legacy",
    "genre" : "Thriller",
    "description" : "Jigsaw is a 2017 American horror film directed by The Spierig Brothers and written by Josh Stolberg and Peter Goldfinger. It is the eighth installment in the Saw film series. The film stars Matt Passmore, Callum Keith Rennie, Clé Bennett, and Hannah Emily Anderson. The plot follows a group of people who find themselves forced to participate in a series of deadly \"games\" inside a barn. Meanwhile, the police leads an investigation on a new series of murders that fit the eponymous Jigsaw Killer's modus operandi, who has been dead for almost a decade at this point."
  },
  {
    "title" : "Murder Mystery",
    "genre" : "Comedy",
    "description" : "Murder Mystery is a 2019 American comedy mystery film directed by Kyle Newacheck and written by James Vanderbilt. The film stars Adam Sandler, Jennifer Aniston, and Luke Evans, and follows a married couple who is caught up in a murder investigation on a billionaire's yacht. It was released on June 14, 2019, by Netflix."
  }
]